 ### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [36]:
import pandas as pd

In [37]:
data = [4,8,15,16,23,42]

In [44]:
data1 = pd.Series(data)

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it

In [39]:
import pandas as pd

In [41]:
x = [1,2,3,4,5,6,7,8,9,10]

In [42]:
my_variable = pd.Series(x)

In [43]:
print(my_variable)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [33]:
import pandas as pd

In [2]:
d = {
'Name' : ["Alice","Bob","Claire"],
'Age' : [25,30,27],
'Sex' : ["Female","Male","Female"]
}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     Name  Age     Sex
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans :- In pandas, a DataFrame is a two-dimensional labeled data structure that is used for data manipulation and analysis. It is similar to a table in a relational database or a spreadsheet, where data is organized in rows and columns.

! Series: A Series is a one-dimensional labeled array that can hold data of any type (integer, float, string, etc.). It is similar to a one-column table or an array with labeled indices.

! DataFrame: A DataFrame is a two-dimensional labeled data structure with columns of potentially different data types. It can be thought of as a collection of Series objects, where each column is a Series.

In [5]:
import pandas as pd

Creating a Series

In [6]:
data = [1,2,3,4,5]

In [7]:
pd.Series(data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions ?

1.head() and tail(): These functions are used to retrieve the first few rows (head()) or the last few rows (tail()) of a DataFrame. They are helpful for quickly inspecting the data.

2.groupby(): It is used to group the DataFrame by one or more columns and perform operations on the grouped data. It allows you to aggregate, transform, filter, or apply custom functions to the grouped data. For example, you can calculate the average salary of employees based on their departments using the groupby() function.

3.drop(): It is used to remove rows or columns from the DataFrame. You can specify the labels of rows or columns to be dropped, and you can also specify the axis (0 for rows, 1 for columns). This function helps in eliminating unwanted data from the DataFrame.

### Example :-

USSING GROUP BY

In [9]:
import pandas as pd

In [10]:
d = {
'Name' : ["Alice","Bob","Claire"],
'Age' : [25,30,27],
'Sex' : ["Female","Male","Female"]
}

In [11]:
pd.DataFrame(d)

     Name  Age     Sex
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
g = df.groupby('Sex')

In [13]:
g

In [14]:
g.mean('Age')

         Age
Sex
Female  26.0
Male    30.0

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans :-  Both DataFrame and Panel are mutable in nature.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [20]:
import pandas as pd

 Create Series objects

In [25]:
names = pd.Series(["Nabodit","Souvik","Suchitro"])

In [26]:
age = pd.Series([19,20,21])

In [27]:
location = pd.Series(["behala","parnashree","Subhash marg"])

Create a DataFrame using the Series

In [29]:
d = {
    'Name' : names,
    'Age'  : age,
    'Lcation' : location
}

In [32]:
pd.DataFrame(d)

       Name  Age       Lcation
0   Nabodit   19        behala
1    Souvik   20    parnashree
2  Suchitro   21  Subhash marg